<script>
    export let width = '10'; // Значение по умолчанию для ширины
    export let height = '6'; // Значение по умолчанию для высоты
    export let style = '';  // Дополнительные стили по желанию
</script>
  
<svg
    {width}
    {height}
    viewBox="0 0 10 6"
    fill="none"
    xmlns="http://www.w3.org/2000/svg"
    style={style}
>
    <path
      d="M4.99998 4.00331L1.2298 0.212403C0.948449 -0.070792 0.492309 -0.070792 0.21099 0.212403C-0.0703299 0.495562 -0.0703299 0.95472 0.21099 1.23795L4.45439 5.50466C4.6043 5.65557 4.80371 5.72348 4.99998 5.71355C5.19628 5.72348 5.39567 5.65557 5.5456 5.50466L9.78898 1.23795C10.0703 0.954737 10.0703 0.495615 9.78898 0.212403C9.50763 -0.0708098 9.05151 -0.070792 8.77022 0.212403L4.99998 4.00331Z"
      fill="black"
    />
</svg>
  